'use strict'

console.log('\
     1.Вёрстка валидная +10 \n \
    2.Вёрстка семантическая +20 =13,5 \n \
        (<header>, <main>, <footer> +3 =3 \n \
        пять элементов <section> (по количеству секций) +3 =3 \n \
        только один заголовок <h1> +3 =3 \n \
        четыре заголовка <h2> (количество секций минус одна, у которой заголовок <h1>) +3 =0 \n \
        один элемент <nav> (панель навигации) +3 =3 \n \
        два списка ul > li > a (панель навигации, ссылки на соцсети) +3 =1,5 \n \
        пять кнопок <button> +2 =0 \n \
    3.Вёрстка соответствует макету +48 \n \
        блок <header> +6 \n \
        секция welcome +7 \n \
        секция about +7 \n \
        секция service +7 \n \
        секция prices +7 \n \
        секция contacts +7 \n \
        блок <footer> +7 \n \
    4.Требования к css + 12 =8 \n \
        для построения сетки используются флексы или гриды +2 =2 \n \
        при уменьшении масштаба страницы браузера вёрстка размещается по центру, а не сдвигается в сторону +2 =0 \n \
        фоновый цвет тянется на всю ширину страницы +2 =2 \n \
        иконки добавлены в формате .svg. SVG может быть добавлен любым способом. Обращаем внимание на формат, а не на способ добавления +2 =2 \n \
        изображения добавлены в формате .jpg или .png +2 =2 \n \
        есть favicon +2 =0 \n \
    5.Интерактивность, реализуемая через css +20 =10 \n \
        плавная прокрутка по якорям +5 =5 \n \
        cсылки в футере при нажатии на них ведут на гитхаб автора проекта и на страницу курса https://rs.school/js-stage0/ +5 =5 \n \
        интерактивность включает в себя не только изменение внешнего вида курсора, например, при помощи свойства cursor: pointer, но и другие визуальные \n \
        эффекты, например, изменение цвета фона или цвета шрифта. Если в макете указаны стили при наведении и клике, для элемента указываем эти стили. Если в макете стили не указаны, \n \
        реализуете их по своему усмотрению, руководствуясь общим стилем макета +5 =0 \n \
        обязательное требование к интерактивности: плавное изменение внешнего вида элемента при наведении и клике не влияющее на соседние элементы +5 =0 \n \ \n \
        Итог: 79,5' );

